---
kind: method
id: M:Autodesk.Revit.DB.FilterNumericValueRule.GetEvaluator
source: html/0d712507-44f1-e2e3-807a-0a36a325bc09.htm
---
# Autodesk.Revit.DB.FilterNumericValueRule.GetEvaluator Method

Gets the evaluator that implements the test for this rule.

## Syntax (C#)
```csharp
public FilterNumericRuleEvaluator GetEvaluator()
```